bekencorp/bk_avdk_smp/ap/middleware/soc/bk7259_ap/soc/pwm_struct.h
typedef volatile union {
	struct {
		uint32_t ccr1_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege1_t;


typedef volatile union {
	struct {
		uint32_t ccr2_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege2_t;


typedef volatile union {
	struct {
		uint32_t ccr3_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege3_t;


typedef volatile union {
	struct {
		uint32_t ccr4_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege4_t;


typedef volatile union {
	struct {
		uint32_t ccr5_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege5_t;


typedef volatile union {
	struct {
		uint32_t ccr6_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege6_t;


typedef volatile union {
	struct {
		uint32_t ccr7_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege7_t;


typedef volatile union {
	struct {
		uint32_t ccr8_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege8_t;


typedef volatile union {
	struct {
		uint32_t ccr9_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_rege9_t;


typedef volatile union {
	struct {
		uint32_t ch6e_shad                :  1; /**<bit[0 : 0] */
		uint32_t ch5e_shad                :  1; /**<bit[1 : 1] */
		uint32_t ch4e_shad                :  1; /**<bit[2 : 2] */
		uint32_t ch3e_shad                :  1; /**<bit[3 : 3] */
		uint32_t ch2e_shad                :  1; /**<bit[4 : 4] */
		uint32_t ch1e_shad                :  1; /**<bit[5 : 5] */
		uint32_t oc1m_shad                :  3; /**<bit[6 : 8] */
		uint32_t oc2m_shad                :  3; /**<bit[9 : 11] */
		uint32_t oc3m_shad                :  3; /**<bit[12 : 14] */
		uint32_t reserved_15_31           : 17; /**<bit[15 : 31] */
	};
	uint32_t v;
} pwm_regea_t;


typedef volatile union {
	struct {
		uint32_t tim1_fade_num            : 10; /**<bit[0 : 9] */
		uint32_t tim1_fade_intval_cyc     : 10; /**<bit[10 : 19] */
		uint32_t tim1_fade_scale          :  8; /**<bit[20 : 27] */
		uint32_t tim1_fade_end_if         :  1; /**<bit[28] */
		uint32_t tim1_fade_end_int_en     :  1; /**<bit[29] */
		uint32_t tim1_fade_inc_dec        :  1; /**<bit[30] */
		uint32_t tim1_duty_fading_en      :  1; /**<bit[31] */
	};
	uint32_t v;
} pwm_regeb_t;


typedef volatile union {
	struct {
		uint32_t tim2_fade_num            : 10; /**<bit[0 : 9] */
		uint32_t tim2_fade_intval_cyc     : 10; /**<bit[10 : 19] */
		uint32_t tim2_fade_scale          :  8; /**<bit[20 : 27] */
		uint32_t tim2_fade_end_if         :  1; /**<bit[28] */
		uint32_t tim2_fade_end_int_en     :  1; /**<bit[29] */
		uint32_t tim2_fade_inc_dec        :  1; /**<bit[30] */
		uint32_t tim2_duty_fading_en      :  1; /**<bit[31] */
	};
	uint32_t v;
} pwm_regec_t;


typedef volatile union {
	struct {
		uint32_t tim3_fade_num            : 10; /**<bit[0 : 9] */
		uint32_t tim3_fade_intval_cyc     : 10; /**<bit[10 : 19] */
		uint32_t tim3_fade_scale          :  8; /**<bit[20 : 27] */
		uint32_t tim3_fade_end_if         :  1; /**<bit[28] */
		uint32_t tim3_fade_end_int_en     :  1; /**<bit[29] */
		uint32_t tim3_fade_inc_dec        :  1; /**<bit[30] */
		uint32_t tim3_duty_fading_en      :  1; /**<bit[31] */
	};
	uint32_t v;
} pwm_reged_t;


typedef volatile union {
	struct {
		uint32_t ocm3pe                   :  1; /**<bit[0 : 0] */
		uint32_t ocm2pe                   :  1; /**<bit[1 : 1] */
		uint32_t ocm1pe                   :  1; /**<bit[2 : 2] */
		uint32_t arpe3                    :  1; /**<bit[3 : 3] */
		uint32_t arpe2                    :  1; /**<bit[4 : 4] */
		uint32_t arpe1                    :  1; /**<bit[5 : 5] */
		uint32_t oc3pe                    :  1; /**<bit[6 : 6] */
		uint32_t oc2pe                    :  1; /**<bit[7 : 7] */
		uint32_t oc1pe                    :  1; /**<bit[8 : 8] */
		uint32_t reserved_9_17            :  9; /**<bit[9 : 17] */
		uint32_t cms_tim3                 :  2; /**<bit[18 : 19] */
		uint32_t cms_tim2                 :  2; /**<bit[20 : 21] */
		uint32_t cms_tim1                 :  2; /**<bit[22 : 23] */
		uint32_t reserved_24_25           :  2; /**<bit[24 : 25] */
		uint32_t urs3                     :  1; /**<bit[26 : 26] */
		uint32_t urs2                     :  1; /**<bit[27 : 27] */
		uint32_t urs1                     :  1; /**<bit[28 : 28] */
		uint32_t dir_tim3                 :  1; /**<bit[29 : 29] */
		uint32_t dir_tim2                 :  1; /**<bit[30 : 30] */
		uint32_t dir_tim1                 :  1; /**<bit[31 : 31] */
	};
	uint32_t v;
} pwm_reg100_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_7             :  8; /**<bit[0 : 7] */
		uint32_t com_mode                 :  1; /**<bit[8 : 8] */
		uint32_t ccpc                     :  1; /**<bit[9 : 9] */
		uint32_t trios3                   :  3; /**<bit[10 : 12] */
		uint32_t adcs3                    :  3; /**<bit[13 : 15] */
		uint32_t reserved_16_16           :  1; /**<bit[16 : 16] */
		uint32_t ccus                     :  1; /**<bit[17 : 17] */
		uint32_t trios2                   :  3; /**<bit[18 : 20] */
		uint32_t adcs2                    :  3; /**<bit[21 : 23] */
		uint32_t reserved_24_25           :  2; /**<bit[24 : 25] */
		uint32_t trios1                   :  3; /**<bit[26 : 28] */
		uint32_t adcs1                    :  3; /**<bit[29 : 31] */
	};
	uint32_t v;
} pwm_reg101_t;


typedef volatile union {
	struct {
		uint32_t sms1                     :  4; /**<bit[0 : 3] */
		uint32_t sms2                     :  4; /**<bit[4 : 7] */
		uint32_t sms3                     :  4; /**<bit[8 : 11] */
		uint32_t ts1                      :  3; /**<bit[12 : 14] */
		uint32_t reserved_15_15           :  1; /**<bit[15 : 15] */
		uint32_t ts2                      :  3; /**<bit[16 : 18] */
		uint32_t ts3                      :  3; /**<bit[19 : 21] */
		uint32_t reserved_22_31           : 10; /**<bit[22 : 31] */
	};
	uint32_t v;
} pwm_reg102_t;


typedef volatile union {
	struct {
		uint32_t cc1ie                    :  1; /**<bit[0 : 0] */
		uint32_t cc2ie                    :  1; /**<bit[1 : 1] */
		uint32_t cc3ie                    :  1; /**<bit[2 : 2] */
		uint32_t cc4ie                    :  1; /**<bit[3 : 3] */
		uint32_t cc5ie                    :  1; /**<bit[4 : 4] */
		uint32_t cc6ie                    :  1; /**<bit[5 : 5] */
		uint32_t cc7ie                    :  1; /**<bit[6 : 6] */
		uint32_t cc8ie                    :  1; /**<bit[7 : 7] */
		uint32_t cc9ie                    :  1; /**<bit[8 : 8] */
		uint32_t uie1                     :  1; /**<bit[9 : 9] */
		uint32_t uie2                     :  1; /**<bit[10 : 10] */
		uint32_t uie3                     :  1; /**<bit[11 : 11] */
		uint32_t tie1                     :  1; /**<bit[12 : 12] */
		uint32_t tie2                     :  1; /**<bit[13 : 13] */
		uint32_t tie3                     :  1; /**<bit[14 : 14] */
		uint32_t comie                    :  1; /**<bit[15 : 15] */
		uint32_t reserved_16_19           :  4; /**<bit[16 : 19] */
		uint32_t df_tim1                  :  4; /**<bit[20 : 23] */
		uint32_t df_tim2                  :  4; /**<bit[24 : 27] */
		uint32_t df_tim3                  :  4; /**<bit[28 : 31] */
	};
	uint32_t v;
} pwm_reg103_t;


typedef volatile union {
	struct {
		uint32_t cc1if                    :  1; /**<bit[0 : 0] */
		uint32_t cc2if                    :  1; /**<bit[1 : 1] */
		uint32_t cc3if                    :  1; /**<bit[2 : 2] */
		uint32_t cc4if                    :  1; /**<bit[3 : 3] */
		uint32_t cc5if                    :  1; /**<bit[4 : 4] */
		uint32_t cc6if                    :  1; /**<bit[5 : 5] */
		uint32_t cc7if                    :  1; /**<bit[6 : 6] */
		uint32_t cc8if                    :  1; /**<bit[7 : 7] */
		uint32_t cc9if                    :  1; /**<bit[8 : 8] */
		uint32_t uif1                     :  1; /**<bit[9 : 9] */
		uint32_t uif2                     :  1; /**<bit[10 : 10] */
		uint32_t uif3                     :  1; /**<bit[11 : 11] */
		uint32_t tif1                     :  1; /**<bit[12 : 12] */
		uint32_t tif2                     :  1; /**<bit[13 : 13] */
		uint32_t tif3                     :  1; /**<bit[14 : 14] */
		uint32_t comif                    :  1; /**<bit[15 : 15] */
		uint32_t ch1eif                   :  1; /**<bit[16 : 16] */
		uint32_t ch2eif                   :  1; /**<bit[17 : 17] */
		uint32_t ch3eif                   :  1; /**<bit[18 : 18] */
		uint32_t ch4eif                   :  1; /**<bit[19 : 19] */
		uint32_t ch5eif                   :  1; /**<bit[20 : 20] */
		uint32_t ch6eif                   :  1; /**<bit[21 : 21] */
		uint32_t reserved_22_31           : 10; /**<bit[22 : 31] */
	};
	uint32_t v;
} pwm_reg104_t;


typedef volatile union {
	struct {
		uint32_t reserved_0_8             :  9; /**<bit[0 : 8] */
		uint32_t ug1                      :  1; /**<bit[9 : 9] */
		uint32_t ug2                      :  1; /**<bit[10 : 10] */
		uint32_t ug3                      :  1; /**<bit[11 : 11] */
		uint32_t tg1                      :  1; /**<bit[12 : 12] */
		uint32_t tg2                      :  1; /**<bit[13 : 13] */
		uint32_t tg3                      :  1; /**<bit[14 : 14] */
		uint32_t comg                     :  1; /**<bit[15 : 15] */
		uint32_t dtm1                     :  2; /**<bit[16 : 17] */
		uint32_t dtm2                     :  2; /**<bit[18 : 19] */
		uint32_t dtm3                     :  2; /**<bit[20 : 21] */
		uint32_t init_level1              :  1; /**<bit[22 : 22] */
		uint32_t init_level2              :  1; /**<bit[23 : 23] */
		uint32_t init_level3              :  1; /**<bit[24 : 24] */
		uint32_t reserved_25_31           :  7; /**<bit[25 : 31] */
	};
	uint32_t v;
} pwm_reg105_t;


typedef volatile union {
	struct {
		uint32_t ch1p                     :  2; /**<bit[0 : 1] */
		uint32_t ch2p                     :  2; /**<bit[2 : 3] */
		uint32_t ch3p                     :  2; /**<bit[4 : 5] */
		uint32_t ch4p                     :  2; /**<bit[6 : 7] */
		uint32_t ch5p                     :  2; /**<bit[8 : 9] */
		uint32_t ch6p                     :  2; /**<bit[10 : 11] */
		uint32_t ch1e                     :  1; /**<bit[12 : 12] */
		uint32_t ch2e                     :  1; /**<bit[13 : 13] */
		uint32_t ch3e                     :  1; /**<bit[14 : 14] */
		uint32_t ch4e                     :  1; /**<bit[15 : 15] */
		uint32_t ch5e                     :  1; /**<bit[16 : 16] */
		uint32_t ch6e                     :  1; /**<bit[17 : 17] */
		uint32_t tim1ccm                  :  1; /**<bit[18 : 18] */
		uint32_t tim2ccm                  :  1; /**<bit[19 : 19] */
		uint32_t tim3ccm                  :  1; /**<bit[20 : 20] */
		uint32_t oc1m                     :  3; /**<bit[21 : 23] */
		uint32_t oc2m                     :  3; /**<bit[24 : 26] */
		uint32_t oc3m                     :  3; /**<bit[27 : 29] */
		uint32_t reserved_30_31           :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} pwm_reg106_t;


typedef volatile union {
	struct {
		uint32_t tim1_cnt                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg107_t;


typedef volatile union {
	struct {
		uint32_t tim2_cnt                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg108_t;


typedef volatile union {
	struct {
		uint32_t tim3_cnt                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg109_t;


typedef volatile union {
	struct {
		uint32_t psc1                     :  8; /**<bit[0 : 7] */
		uint32_t psc2                     :  8; /**<bit[8 : 15] */
		uint32_t psc3                     :  8; /**<bit[16 : 23] */
		uint32_t reserved_24_31           :  8; /**<bit[24 : 31] */
	};
	uint32_t v;
} pwm_reg10a_t;


typedef volatile union {
	struct {
		uint32_t tim1_arr                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg10b_t;


typedef volatile union {
	struct {
		uint32_t tim2_arr                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg10c_t;


typedef volatile union {
	struct {
		uint32_t tim3_arr                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg10d_t;


typedef volatile union {
	struct {
		uint32_t tim1_rcr                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg10e_t;


typedef volatile union {
	struct {
		uint32_t tim2_rcr                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg10f_t;


typedef volatile union {
	struct {
		uint32_t tim3_rcr                 : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg110_t;


typedef volatile union {
	struct {
		uint32_t ccr1                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg111_t;


typedef volatile union {
	struct {
		uint32_t ccr2                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg112_t;


typedef volatile union {
	struct {
		uint32_t ccr3                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg113_t;


typedef volatile union {
	struct {
		uint32_t ccr4                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg114_t;


typedef volatile union {
	struct {
		uint32_t ccr5                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg115_t;


typedef volatile union {
	struct {
		uint32_t ccr6                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg116_t;


typedef volatile union {
	struct {
		uint32_t ccr7                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg117_t;


typedef volatile union {
	struct {
		uint32_t ccr8                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg118_t;


typedef volatile union {
	struct {
		uint32_t ccr9                     : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg119_t;


typedef volatile union {
	struct {
		uint32_t dt1                      : 10; /**<bit[0 : 9] */
		uint32_t dt2                      : 10; /**<bit[10 : 19] */
		uint32_t dt3                      : 10; /**<bit[20 : 29] */
		uint32_t reserved_30_31           :  2; /**<bit[30 : 31] */
	};
	uint32_t v;
} pwm_reg11a_t;


typedef volatile union {
	struct {
		uint32_t tim1_arr_shad            : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg11b_t;


typedef volatile union {
	struct {
		uint32_t tim2_arr_shad            : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg11c_t;


typedef volatile union {
	struct {
		uint32_t tim3_arr_shad            : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg11d_t;


typedef volatile union {
	struct {
		uint32_t tim1_rcr_shad            : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg11e_t;


typedef volatile union {
	struct {
		uint32_t tim2_rcr_shad            : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg11f_t;


typedef volatile union {
	struct {
		uint32_t tim3_rcr_shad            : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg120_t;


typedef volatile union {
	struct {
		uint32_t ccr1_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg121_t;


typedef volatile union {
	struct {
		uint32_t ccr2_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg122_t;


typedef volatile union {
	struct {
		uint32_t ccr3_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg123_t;


typedef volatile union {
	struct {
		uint32_t ccr4_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg124_t;


typedef volatile union {
	struct {
		uint32_t ccr5_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg125_t;


typedef volatile union {
	struct {
		uint32_t ccr6_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg126_t;


typedef volatile union {
	struct {
		uint32_t ccr7_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg127_t;


typedef volatile union {
	struct {
		uint32_t ccr8_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg128_t;


typedef volatile union {
	struct {
		uint32_t ccr9_shad                : 32; /**<bit[0 : 31] */
	};
	uint32_t v;
} pwm_reg129_t;


typedef volatile union {
	struct {
		uint32_t ch6e_shad                :  1; /**<bit[0 : 0] */
		uint32_t ch5e_shad                :  1; /**<bit[1 : 1] */
		uint32_t ch4e_shad                :  1; /**<bit[2 : 2] */
		uint32_t ch3e_shad                :  1; /**<bit[3 : 3] */
		uint32_t ch2e_shad                :  1; /**<bit[4 : 4] */
		uint32_t ch1e_shad                :  1; /**<bit[5 : 5] */
		uint32_t oc1m_shad                :  3; /**<bit[6 : 8] */
		uint32_t oc2m_shad                :  3; /**<bit[9 : 11] */
		uint32_t oc3m_shad                :  3; /**<bit[12 : 14] */
		uint32_t reserved_15_31           : 17; /**<bit[15 : 31] */
	};
	uint32_t v;
} pwm_reg12a_t;


typedef volatile union {
	struct {
		uint32_t tim1_fade_num            : 10; /**<bit[0 : 9] */
		uint32_t tim1_fade_intval_cyc     : 10; /**<bit[10 : 19] */
		uint32_t tim1_fade_scale          :  8; /**<bit[20 : 27] */
		uint32_t tim1_fade_end_if         :  1; /**<bit[28] */
		uint32_t tim1_fade_end_int_en     :  1; /**<bit[29] */
		uint32_t tim1_fade_inc_dec        :  1; /**<bit[30] */
		uint32_t tim1_duty_fading_en      :  1; /**<bit[31] */
	};
	uint32_t v;
} pwm_reg12b_t;


typedef volatile union {
	struct {
		uint32_t tim2_fade_num            : 10; /**<bit[0 : 9] */
		uint32_t tim2_fade_intval_cyc     : 10; /**<bit[10 : 19] */
		uint32_t tim2_fade_scale          :  8; /**<bit[20 : 27] */
		uint32_t tim2_fade_end_if         :  1; /**<bit[28] */
		uint32_t tim2_fade_end_int_en     :  1; /**<bit[29] */
		uint32_t tim2_fade_inc_dec        :  1; /**<bit[30] */
		uint32_t tim2_duty_fading_en      :  1; /**<bit[31] */
	};
	uint32_t v;
} pwm_reg12c_t;


typedef volatile union {
	struct {
		uint32_t tim3_fade_num            : 10; /**<bit[0 : 9] */
		uint32_t tim3_fade_intval_cyc     : 10; /**<bit[10 : 19] */
		uint32_t tim3_fade_scale          :  8; /**<bit[20 : 27] */
		uint32_t tim3_fade_end_if         :  1; /**<bit[28] */
		uint32_t tim3_fade_end_int_en     :  1; /**<bit[29] */
		uint32_t tim3_fade_inc_dec        :  1; /**<bit[30] */
		uint32_t tim3_duty_fading_en      :  1; /**<bit[31] */
	};
	uint32_t v;
} pwm_reg12d_t;


